In [1]:
%load_ext sql

# Conect to a Superstore Database

In [2]:
%sql sqlite:///superstore.db

# 1) Finding Unique Values with SELECT DISTINCT

In this lesson we'll focus on filtering data that is **text-based**. Filtering on text values is important because many databases store a large amount of textual data, such as customer names, addresses, and product information. Text-based filtering allows us to find records that contain a certain word or phrase or match a specific pattern, even if we don't know the exact value to search for.

To get started, let's look at a useful way to find a list of all *distinct* values in a field.

This can be done in SQL with SELECT DISTINCT. For example, we can find all the unique values of category in the orders table:

In [3]:
%%sql
SELECT DISTINCT category
  FROM orders;

 * sqlite:///superstore.db
Done.

[('Furniture',), ('Office Supplies',), ('Technology',)]

You may have noticed that `subcategory` relates to `category`. To confirm, we could include both fields in our `SELECT DISTINCT` clause to find all the unique combinations of these categories. Notice that `DISTINCT` has to come before any column names and then applies to the whole query.

In [4]:
%%sql
SELECT DISTINCT category, subcategory
  FROM orders;

 * sqlite:///superstore.db
Done.

[('Furniture', 'Bookcases'),
 ('Furniture', 'Chairs'),
 ('Office Supplies', 'Labels'),
 ('Furniture', 'Tables'),
 ('Office Supplies', 'Storage'),
 ('Furniture', 'Furnishings'),
 ('Office Supplies', 'Art'),
 ('Technology', 'Phones'),
 ('Office Supplies', 'Binders'),
 ('Office Supplies', 'Appliances'),
 ('Office Supplies', 'Paper'),
 ('Technology', 'Accessories'),
 ('Office Supplies', 'Envelopes'),
 ('Office Supplies', 'Fasteners'),
 ('Office Supplies', 'Supplies'),
 ('Technology', 'Machines'),
 ('Technology', 'Copiers')]

## Instructions

The Eastern regional manager wants a list of all order IDs and customer names from Buffalo, New York.

1. Write a query that includes a list of all unique `order_id` and `customer_name` values.

1. Filter the results to the `city` of Buffalo in the `state` of New York.

In [5]:
%%sql
SELECT DISTINCT order_id, customer_name
from orders
where city = 'Buffalo'
and state = 'New York'

 * sqlite:///superstore.db
Done.

[('CA-2015-132570', 'Kean Thornton'),
 ('US-2016-142685', 'Maureen Gnade'),
 ('CA-2014-150301', 'Michelle Huthwaite'),
 ('CA-2014-128209', 'Greg Tran'),
 ('CA-2015-166947', 'Edward Becker'),
 ('CA-2017-112844', 'Stefania Perrino'),
 ('CA-2014-167486', "Jack O'Briant")]

# 2) Filtering for Categories with IN

In an earlier lesson we used the `IN` operator to find a group of non-consecutive numeric values in a field.

This operator can similarly be used with **text**, or **string**, data to pull out a list of categories in a field. 

For example, let's say we want to conduct an analysis of just the '`West`' and '`East`' regions of the orders table:

In [8]:
%%sql
SELECT order_id, product_id, region
  FROM orders
 WHERE region IN ('West', 'East')
 Limit 5;

 * sqlite:///superstore.db
Done.

[('CA-2016-138688', 'OFF-LA-10000240', 'West'),
 ('CA-2014-115812', 'FUR-FU-10001487', 'West'),
 ('CA-2014-115812', 'OFF-AR-10002833', 'West'),
 ('CA-2014-115812', 'TEC-PH-10002275', 'West'),
 ('CA-2014-115812', 'OFF-BI-10003910', 'West')]

## Instructions

Your supervisor has noticed a few states that never ship with First Class mail. They want you to investigate which shipping methods customers in these states utilize.

1. Write a query that shows ship_mode and state for the following places:

District of Columbia

North Dakota

Vermont

West Virginia

1. Make sure you don't have any duplicates in your output.

In [9]:
%%sql
SELECT DISTINCT ship_mode, state
from orders
where state IN ('District of Columbia', 'North Dakota', 'Vermont','West Virginia')

 * sqlite:///superstore.db
Done.

[('Standard Class', 'District of Columbia'),
 ('Second Class', 'District of Columbia'),
 ('Standard Class', 'Vermont'),
 ('Second Class', 'North Dakota'),
 ('Second Class', 'Vermont'),
 ('Standard Class', 'North Dakota'),
 ('Standard Class', 'West Virginia'),
 ('Same Day', 'West Virginia')]

# 3) Flipping the Script with NOT

Keyword `NOT` can be used in other cases, too. Rather than keeping conditions that do meet some criteria, we keep those that do not.

For example, if we wanted to keep all records except those from the West region, we could write this query:

In [11]:
%%sql
SELECT order_id, product_id, sales
  FROM orders
 WHERE NOT region = 'West'
 LiMIT 5;

 * sqlite:///superstore.db
Done.

[('CA-2016-152156', 'FUR-BO-10001798', 261.96),
 ('CA-2016-152156', 'FUR-CH-10000454', 731.94),
 ('US-2015-108966', 'FUR-TA-10000577', 957.5775),
 ('US-2015-108966', 'OFF-ST-10000760', 22.368),
 ('CA-2017-114412', 'OFF-PA-10002365', 15.552)]

The query above can also be written with the mathematical operator `<>`:

In [12]:
%%sql
SELECT order_id, product_id, sales
  FROM orders
 WHERE region <> 'West'
 LiMIT 5;

 * sqlite:///superstore.db
Done.

[('CA-2016-152156', 'FUR-BO-10001798', 261.96),
 ('CA-2016-152156', 'FUR-CH-10000454', 731.94),
 ('US-2015-108966', 'FUR-TA-10000577', 957.5775),
 ('US-2015-108966', 'OFF-ST-10000760', 22.368),
 ('CA-2017-114412', 'OFF-PA-10002365', 15.552)]

Using `NOT` is more efficient when we're excluding a large number of values. This is because the database can use an index to quickly identify the records to exclude. In contrast, using the inequality operator requires scanning the entire table and comparing each row to the specified value.

While database efficiency is important, the true power of `NOT` occurs when we combine it with `IN`, because it allows us to exclude records that match any of the specified values in a list.

In [13]:
%%sql
SELECT order_id, product_id, sales
  FROM orders
 WHERE region NOT IN ('West', 'South')
 Limit 5;

 * sqlite:///superstore.db
Done.

[('US-2015-118983', 'OFF-AP-10002311', 68.81),
 ('US-2015-118983', 'OFF-BI-10000756', 2.544),
 ('CA-2014-105893', 'OFF-ST-10004186', 665.88),
 ('CA-2016-137330', 'OFF-AR-10000246', 19.46),
 ('CA-2016-137330', 'OFF-AP-10001492', 60.34)]

`NOT` can also be combined with other conditions using the AND and OR operators. This allows us to create more complex filtering conditions.

For example, let's say we want to keep records with sales greater than 500 and exclude those from the '`West`' and '`South`' regions:

In [14]:
%%sql
SELECT order_id, product_id, sales
  FROM orders
 WHERE sales > 500 AND region NOT IN ('West', 'South')
 Limit 5;

 * sqlite:///superstore.db
Done.

[('CA-2014-105893', 'OFF-ST-10004186', 665.88),
 ('US-2015-150630', 'FUR-BO-10004834', 3083.43),
 ('CA-2016-117590', 'TEC-PH-10004977', 1097.544),
 ('CA-2015-117415', 'FUR-BO-10002545', 532.3992),
 ('CA-2016-105816', 'TEC-PH-10002447', 1029.95)]

## Instructions

Superstore's Top Three performing states are California, Texas, and New York. Your supervisor wants you to find other states with sales potential.

1. Write a query that includes `order_id`, `city`, `state`, and `sales`.

1. Your query should exclude the Top Three states as well as only look at sales over $5,000.

In [15]:
%%sql
SELECT order_id, city, state, sales
from orders
where state NOT IN ('California','Texas','New York')
and sales > 5000

 * sqlite:///superstore.db
Done.

[('CA-2015-145352', 'Atlanta', 'Georgia', 6354.95),
 ('US-2017-168116', 'Burlington', 'North Carolina', 7999.98),
 ('CA-2014-145317', 'Jacksonville', 'Florida', 22638.48),
 ('CA-2014-116904', 'Minneapolis', 'Minnesota', 9449.95),
 ('CA-2017-166709', 'Newark', 'Delaware', 10499.97),
 ('US-2016-107440', 'Lakewood', 'New Jersey', 9099.93),
 ('CA-2016-143714', 'Philadelphia', 'Pennsylvania', 8399.976),
 ('CA-2017-138289', 'Jackson', 'Michigan', 5443.96),
 ('CA-2016-118689', 'Lafayette', 'Indiana', 17499.95),
 ('US-2016-140158', 'Providence', 'Rhode Island', 5399.91),
 ('CA-2017-140151', 'Seattle', 'Washington', 13999.96),
 ('CA-2016-158841', 'Arlington', 'Virginia', 8749.95),
 ('CA-2016-117121', 'Detroit', 'Michigan', 9892.74)]

# 4) Searching for Text Patterns with LIKE (Part 1)

SQL includes a number of so-called wildcard operators which are special characters that can be substituted for other characters.

For example, the `*` in `SELECT *` is a wildcard for "all."

The `LIKE` operator in conjunction with `WHERE` can be used to search for a specified pattern in a text column. In particular, we'll often see the `%` character, which matches any number of characters (including zero).

For example, Superstore carries a number of products from Xerox. Let's say we want to pull every record from the `product_name` column that starts with **Xerox**. We can do so by adding a `%` after Xerox to indicate SQL should return any record matching this pattern:

In [17]:
%%sql
SELECT DISTINCT product_name
  FROM orders
 WHERE product_name LIKE 'Xerox %'
 LiMIT 5;

 * sqlite:///superstore.db
Done.

[('Xerox 1967',),
 ('Xerox 232',),
 ('Xerox 1943',),
 ('Xerox 1995',),
 ('Xerox 1999',)]

The % doesn't have to be used just once or at the end of words, though. For example, the query below shows matches for customer names that have the text "allen" anywhere.

Notice that Alejandro Ballentine was also included in the output because their last name contains the phrase "allen." This helps demonstrate that LIKE is not case sensitive.

In [18]:
%%sql
SELECT DISTINCT customer_name
  FROM orders
 WHERE customer_name LIKE '%Allen%'
 LiMIT 5;

 * sqlite:///superstore.db
Done.

[('Andrew Allen',),
 ('Allen Rosenblatt',),
 ('Allen Armold',),
 ('Allen Goldenen',),
 ('Alejandro Ballentine',)]

## Instructions

You have been asked to find the product names for all keyboard-related items that Superstore sells.

1. Write a query that includes all unique values for `subcategory` and `product_name`.

1. Filter your results to products related to keyboards.

In [19]:
%%sql
SELECT DISTINCT subcategory, product_name
from orders
where product_name like '%keyboard%'
Limit 5;

 * sqlite:///superstore.db
Done.

[('Accessories', 'Logitech K350 2.4Ghz Wireless Keyboard'),
 ('Accessories', 'Logitech\xa0Gaming G510s - Keyboard'),
 ('Accessories', 'HP Standard 104 key PS/2 Keyboard'),
 ('Accessories', 'Microsoft Natural Keyboard Elite'),
 ('Accessories', 'Logitech Media Keyboard K200')]

# 5) Searching for Text Patterns with LIKE (Part 2)

Another useful wildcard to use with LIKE is `_`. The `_` wildcard is a pattern matching character that matches any single character in a string. When used in conjunction with the LIKE keyword, it allows us to search for records that match a certain pattern, even if we don't know the exact value to search for.

For example, suppose we want to find all states in the orders table with names that have exactly **four characters**. We can use the `_` wildcard four times with the LIKE keyword to find all records that have a name with four characters. Here's an example query:

In [20]:
%%sql
SELECT DISTINCT state
  FROM orders
 WHERE state LIKE '____';

 * sqlite:///superstore.db
Done.

[('Utah',), ('Iowa',), ('Ohio',)]

The `_` wildcard can also be used in combination with `%`. For example, to find all customers whose first name starts with "M" and is exactly five characters long, we can write the following query.

Notice that "M" is followed by 4 _ wildcards to create a five-letter first name, and the `%` wild card happens after a space to account for last names of any length.

In [22]:
%%sql
SELECT DISTINCT customer_name
  FROM orders
 WHERE customer_name LIKE 'M____ %';

 * sqlite:///superstore.db
Done.

[('Maria Bertelson',),
 ('Mitch Willingham',),
 ('Maria Etezadi',),
 ('Maris LaWare',),
 ('Maria Zettner',),
 ('Mitch Webber',),
 ('Mitch Gastineau',)]

## Instructions

A new product shipment has come into the warehouse, but the product label was damaged during transport so we can't tell what the product is called.

We can tell that the first word has **five letters** and the second word has **seven letters**, but we don't know how many subsequent words there are, nor how many letters each of them would have.

In [23]:
%%sql
SELECT DISTINCT product_name
FROM orders
WHERE product_name LIKE 'Pr___ C_l____ %';

 * sqlite:///superstore.db
Done.

[('Prang Colored Pencils',)]

# 6) Parentheses for Multiple Criteria

Earlier in the course we learned about selecting multiple criteria with `AND`, `OR`, `IN` and `BETWEEN`. These logical operators can get quite complex. Grouping conditions with parentheses can establish an order of operations inside our `WHERE` clause. Parentheses can also help add clarity to our query to improve readability.

For example, we've been asked to pull records of high-value transactions where sales are at least **$100**, or where units sold are *both* below five and profit is greater than 50.

In this case, we're using `AND` with `OR` statements together and want to explicitly define which go together:

In [26]:
%%sql
SELECT order_id, product_id, sales, quantity, profit
  FROM orders
 WHERE sales > 100 OR
       (quantity < 5 AND profit > 50)
       
limit 5;

 * sqlite:///superstore.db
Done.

[('CA-2016-152156', 'FUR-BO-10001798', 261.96, 2, 41.9136),
 ('CA-2016-152156', 'FUR-CH-10000454', 731.94, 3, 219.582),
 ('US-2015-108966', 'FUR-TA-10000577', 957.5775, 5, -383.031),
 ('CA-2014-115812', 'TEC-PH-10002275', 907.152, 6, 90.7152),
 ('CA-2014-115812', 'OFF-AP-10002892', 114.9, 5, 34.47)]

## Instructions

You've been asked to look at the best-performing and worst-performing products the store sells.

1. Write a query that includes at least `product_name`, `subcategory`, `sales`, and `profit`.

1. Filter the results to include only records where either of the following conditions are met:

    * sales are greater than $5000 and profit is greater than $1000
    
    * profit losses are more than $10 and sales are under $10

In [28]:
%%sql
SELECT product_name,
subcategory,
sales,
profit
from orders
WHERE (sales > 5000 and profit > 1000) or (profit <-10 and sales < 10)
limit 5;

 * sqlite:///superstore.db
Done.

[('Holmes Odor Grabber', 'Appliances', 8.652, -20.3322),
 ('Fellowes PB500 Electric Punch Plastic Comb Binding Machine with Manual Bind', 'Binders', 6354.95, 3177.475),
 ('Cardinal Slant-D Ring Binder, Heavy Gauge Vinyl', 'Binders', 8.69, -14.773),
 ('Avery Premier Heavy-Duty Binder with Round Locking Rings', 'Binders', 8.568, -14.5656),
 ('Holmes Cool Mist Humidifier for the Whole House with 8-Gallon Output per Day, Extended Life Filter', 'Appliances', 7.96, -13.93)]